# language:ru
# encoding: utf-8
Функционал: Строительство и ремонт -> Неконечные рубрики

  Контекст:
    Когда открыта страница для региона "Россия"

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Инструменты"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Двери, окна, балконы, лестницы"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Материалы"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Сантехника"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Электрика"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Строительство и ремонт -> Отопление"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |
