# language:ru
# encoding: utf-8
Функционал: Все для дачи

  Контекст:
    Когда открыта страница для региона "Россия"

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Садовая техника"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Садовые инструменты, инвентарь"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Товары для садоводства"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Садовая мебель, сантехника, декор"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Грили, мангалы"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Для бань и саун"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Камины, печи"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Все для дачи -> Бассейны и принадлежности"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |
