# language:ru
# encoding: utf-8
Функционал: Товары для детей -> Детские коляски

  Контекст:
    Когда открыта страница для региона "Россия"

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Товары для детей -> Детская мебель"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Товары для детей -> Товары для малышей"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |
