# language:ru
# encoding: utf-8
Функционал: Импорт c новым типом региона


  Сценарий: Импорт объявления в Петербург c метро Адмиралтейская
    Когда я обновляю и импортирую файл "real-estate_apartments-sale_new/scenario6.xml" для роли "Пользователь для импорта"

    Когда открыта страница для региона "Санкт-Петербург"
        * я вхожу под пользователем с ролью "Пользователь для импорта"
        * я перехожу в список моих объявлений
       То в ЛК ОП объявление с названием "Помощь в получении кредита. Деньги за 1 час!" присутствует в списке
    Когда я открываю детали этого объявления
       То в деталях объявления категории "Недвижимость -> Квартиры. Продажа -> Новостройки" "Регион" равно "Санкт-Петербург"
